labplus-cn/arduino_esp32_v3_0_0/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

labplus_mpython_v3.name=mPython V3
labplus_mpython_v3.vid.0=0x303a
labplus_mpython_v3.pid.0=0x1001

labplus_mpython_v3.bootloader.tool=esptool_py
labplus_mpython_v3.bootloader.tool.default=esptool_py

labplus_mpython_v3.upload.tool=esptool_py
labplus_mpython_v3.upload.tool.default=esptool_py
labplus_mpython_v3.upload.tool.network=esp_ota

labplus_mpython_v3.upload.maximum_size=1310720
labplus_mpython_v3.upload.maximum_data_size=327680
labplus_mpython_v3.upload.flags=
labplus_mpython_v3.upload.extra_flags=
labplus_mpython_v3.upload.use_1200bps_touch=false
labplus_mpython_v3.upload.wait_for_upload_port=false

labplus_mpython_v3.serial.disableDTR=false
labplus_mpython_v3.serial.disableRTS=false

labplus_mpython_v3.build.tarch=xtensa
labplus_mpython_v3.build.bootloader_addr=0x0
labplus_mpython_v3.build.target=esp32s3
labplus_mpython_v3.build.mcu=esp32s3
labplus_mpython_v3.build.core=esp32
labplus_mpython_v3.build.variant=labplus_mpython_v3
labplus_mpython_v3.build.board=MPYTHON_V3

labplus_mpython_v3.build.usb_mode=1
labplus_mpython_v3.build.cdc_on_boot=0
labplus_mpython_v3.build.msc_on_boot=0
labplus_mpython_v3.build.dfu_on_boot=0
labplus_mpython_v3.build.f_cpu=240000000L
labplus_mpython_v3.build.flash_size=16MB
labplus_mpython_v3.build.flash_freq=80m
labplus_mpython_v3.build.flash_mode=dio
labplus_mpython_v3.build.boot=qio
labplus_mpython_v3.build.boot_freq=80m
labplus_mpython_v3.build.partitions=default
labplus_mpython_v3.build.defines=
labplus_mpython_v3.build.loop_core=
labplus_mpython_v3.build.event_core=
labplus_mpython_v3.build.psram_type=qspi
labplus_mpython_v3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
labplus_mpython_v3.menu.JTAGAdapter.default=Disabled
labplus_mpython_v3.menu.JTAGAdapter.default.build.copy_jtag_files=0
labplus_mpython_v3.menu.JTAGAdapter.builtin=Integrated USB JTAG
labplus_mpython_v3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
labplus_mpython_v3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
labplus_mpython_v3.menu.JTAGAdapter.external=FTDI Adapter
labplus_mpython_v3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
labplus_mpython_v3.menu.JTAGAdapter.external.build.copy_jtag_files=1
labplus_mpython_v3.menu.JTAGAdapter.bridge=ESP USB Bridge
labplus_mpython_v3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
labplus_mpython_v3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

labplus_mpython_v3.menu.PSRAM.enabled=QSPI PSRAM
labplus_mpython_v3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
labplus_mpython_v3.menu.PSRAM.enabled.build.psram_type=qspi
labplus_mpython_v3.menu.PSRAM.disabled=Disabled
labplus_mpython_v3.menu.PSRAM.disabled.build.defines=
labplus_mpython_v3.menu.PSRAM.disabled.build.psram_type=qspi
labplus_mpython_v3.menu.PSRAM.opi=OPI PSRAM
labplus_mpython_v3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
labplus_mpython_v3.menu.PSRAM.opi.build.psram_type=opi

labplus_mpython_v3.menu.FlashMode.qio=QIO 80MHz
labplus_mpython_v3.menu.FlashMode.qio.build.flash_mode=dio
labplus_mpython_v3.menu.FlashMode.qio.build.boot=qio
labplus_mpython_v3.menu.FlashMode.qio.build.boot_freq=80m
labplus_mpython_v3.menu.FlashMode.qio.build.flash_freq=80m
labplus_mpython_v3.menu.FlashMode.qio120=QIO 120MHz
labplus_mpython_v3.menu.FlashMode.qio120.build.flash_mode=dio
labplus_mpython_v3.menu.FlashMode.qio120.build.boot=qio
labplus_mpython_v3.menu.FlashMode.qio120.build.boot_freq=120m
labplus_mpython_v3.menu.FlashMode.qio120.build.flash_freq=80m
labplus_mpython_v3.menu.FlashMode.dio=DIO 80MHz
labplus_mpython_v3.menu.FlashMode.dio.build.flash_mode=dio
labplus_mpython_v3.menu.FlashMode.dio.build.boot=dio
labplus_mpython_v3.menu.FlashMode.dio.build.boot_freq=80m
labplus_mpython_v3.menu.FlashMode.dio.build.flash_freq=80m
labplus_mpython_v3.menu.FlashMode.opi=OPI 80MHz
labplus_mpython_v3.menu.FlashMode.opi.build.flash_mode=dout
labplus_mpython_v3.menu.FlashMode.opi.build.boot=opi
labplus_mpython_v3.menu.FlashMode.opi.build.boot_freq=80m
labplus_mpython_v3.menu.FlashMode.opi.build.flash_freq=80m

labplus_mpython_v3.menu.FlashSize.16M=16MB (128Mb)
labplus_mpython_v3.menu.FlashSize.16M.build.flash_size=16MB

labplus_mpython_v3.menu.LoopCore.1=Core 1
labplus_mpython_v3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
labplus_mpython_v3.menu.LoopCore.0=Core 0
labplus_mpython_v3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

labplus_mpython_v3.menu.EventsCore.1=Core 1
labplus_mpython_v3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
labplus_mpython_v3.menu.EventsCore.0=Core 0
labplus_mpython_v3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

labplus_mpython_v3.menu.USBMode.hwcdc=Hardware CDC and JTAG
labplus_mpython_v3.menu.USBMode.hwcdc.build.usb_mode=1
labplus_mpython_v3.menu.USBMode.default=USB-OTG (TinyUSB)
labplus_mpython_v3.menu.USBMode.default.build.usb_mode=0

labplus_mpython_v3.menu.CDCOnBoot.default=Disabled
labplus_mpython_v3.menu.CDCOnBoot.default.build.cdc_on_boot=0
labplus_mpython_v3.menu.CDCOnBoot.cdc=Disabled
labplus_mpython_v3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

labplus_mpython_v3.menu.MSCOnBoot.default=Disabled
labplus_mpython_v3.menu.MSCOnBoot.default.build.msc_on_boot=0
labplus_mpython_v3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
labplus_mpython_v3.menu.MSCOnBoot.msc.build.msc_on_boot=1

labplus_mpython_v3.menu.DFUOnBoot.default=Disabled
labplus_mpython_v3.menu.DFUOnBoot.default.build.dfu_on_boot=0
labplus_mpython_v3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
labplus_mpython_v3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

labplus_mpython_v3.menu.UploadMode.default=UART0 / Hardware CDC
labplus_mpython_v3.menu.UploadMode.default.upload.use_1200bps_touch=false
labplus_mpython_v3.menu.UploadMode.default.upload.wait_for_upload_port=false
labplus_mpython_v3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
labplus_mpython_v3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
labplus_mpython_v3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

labplus_mpython_v3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
labplus_mpython_v3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
labplus_mpython_v3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
labplus_mpython_v3.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
labplus_mpython_v3.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
labplus_mpython_v3.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
labplus_mpython_v3.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
labplus_mpython_v3.menu.PartitionScheme.custom=Custom
labplus_mpython_v3.menu.PartitionScheme.custom.build.partitions=
labplus_mpython_v3.menu.PartitionScheme.custom.upload.maximum_size=16777216

labplus_mpython_v3.menu.CPUFreq.240=240MHz (WiFi)
labplus_mpython_v3.menu.CPUFreq.240.build.f_cpu=240000000L
labplus_mpython_v3.menu.CPUFreq.160=160MHz (WiFi)
labplus_mpython_v3.menu.CPUFreq.160.build.f_cpu=160000000L
labplus_mpython_v3.menu.CPUFreq.80=80MHz (WiFi)
labplus_mpython_v3.menu.CPUFreq.80.build.f_cpu=80000000L
labplus_mpython_v3.menu.CPUFreq.40=40MHz
labplus_mpython_v3.menu.CPUFreq.40.build.f_cpu=40000000L
labplus_mpython_v3.menu.CPUFreq.20=20MHz
labplus_mpython_v3.menu.CPUFreq.20.build.f_cpu=20000000L
labplus_mpython_v3.menu.CPUFreq.10=10MHz
labplus_mpython_v3.menu.CPUFreq.10.build.f_cpu=10000000L

labplus_mpython_v3.menu.UploadSpeed.921600=921600
labplus_mpython_v3.menu.UploadSpeed.921600.upload.speed=921600
labplus_mpython_v3.menu.UploadSpeed.115200=115200
labplus_mpython_v3.menu.UploadSpeed.115200.upload.speed=115200
labplus_mpython_v3.menu.UploadSpeed.256000.windows=256000
labplus_mpython_v3.menu.UploadSpeed.256000.upload.speed=256000
labplus_mpython_v3.menu.UploadSpeed.230400.windows.upload.speed=256000
labplus_mpython_v3.menu.UploadSpeed.230400=230400
labplus_mpython_v3.menu.UploadSpeed.230400.upload.speed=230400
labplus_mpython_v3.menu.UploadSpeed.460800.linux=460800
labplus_mpython_v3.menu.UploadSpeed.460800.macosx=460800
labplus_mpython_v3.menu.UploadSpeed.460800.upload.speed=460800
labplus_mpython_v3.menu.UploadSpeed.512000.windows=512000
labplus_mpython_v3.menu.UploadSpeed.512000.upload.speed=512000

labplus_mpython_v3.menu.DebugLevel.none=None
labplus_mpython_v3.menu.DebugLevel.none.build.code_debug=0
labplus_mpython_v3.menu.DebugLevel.error=Error
labplus_mpython_v3.menu.DebugLevel.error.build.code_debug=1
labplus_mpython_v3.menu.DebugLevel.warn=Warn
labplus_mpython_v3.menu.DebugLevel.warn.build.code_debug=2
labplus_mpython_v3.menu.DebugLevel.info=Info
labplus_mpython_v3.menu.DebugLevel.info.build.code_debug=3
labplus_mpython_v3.menu.DebugLevel.debug=Debug
labplus_mpython_v3.menu.DebugLevel.debug.build.code_debug=4
labplus_mpython_v3.menu.DebugLevel.verbose=Verbose
labplus_mpython_v3.menu.DebugLevel.verbose.build.code_debug=5

labplus_mpython_v3.menu.EraseFlash.none=Disabled
labplus_mpython_v3.menu.EraseFlash.none.upload.erase_cmd=
labplus_mpython_v3.menu.EraseFlash.all=Enabled
labplus_mpython_v3.menu.EraseFlash.all.upload.erase_cmd=-e

labplus_mpython_v3.menu.ZigbeeMode.default=Disabled
labplus_mpython_v3.menu.ZigbeeMode.default.build.zigbee_mode=
labplus_mpython_v3.menu.ZigbeeMode.default.build.zigbee_libs=
labplus_mpython_v3.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
labplus_mpython_v3.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
labplus_mpython_v3.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

##################################################################################################################
